In [1]:
import pandas as pd

In [5]:
df = pd.read_clipboard()
df

      编号    名称   名称2  在库数量   总数量
0  A.001  xyz1  mnq1   100  1000
1  A.002  xyz2  mnq2   200  2000
2  A.003  xyz3  mnq3   300  3000
3  A.004  xyz4  mnq4   400  4000
4  A.005  xyz5  mnq5   500  5000
5  A.001  xyz1  mnq1    10   100
6  A.002  xyz2  mnq2    20   200
7  A.003  xyz3  mnq3    30   300

In [6]:
df.groupby(df.columns[:3].to_list(),as_index = False).sum()

      编号    名称   名称2  在库数量   总数量
0  A.001  xyz1  mnq1   110  1100
1  A.002  xyz2  mnq2   220  2200
2  A.003  xyz3  mnq3   330  3300
3  A.004  xyz4  mnq4   400  4000
4  A.005  xyz5  mnq5   500  5000

In [4]:
df.columns[:3].to_list()

['编号', '名称', '名称2']